XYZ.#ctor(XYZInitGarbage)
XYZ(XYZ_Garbage) will do nothing.
I.e, this will create an object with unitialized data members.
Use this if you are going to initialize via other means
(e.g., via a stupid getter) and performance is critical.

XYZ
A self-initializing 3d point/vector class.
Notes:
This is intended to be a drop-in replacement for Vec3d.  This means transparent operations with
Vec3d, AKA double*, methods.  This means the compiler may not catch some type errors.
We do, yes, we do return by value because the worst that can happen is gratuitous copying of 24
bytes, and we can live with it. In general, we let the compiler figure out the temporary
storage and optimize inlines.